muskum09ari/STM32/uart3_lcd/Src/main.c
#include <stdint.h>
#include <stm32f405xx.h>
#include "lcd.h"

void usart3_init(void);
void usart3_write(uint8_t);
uint8_t usart3_read(void);

uint8_t result=0;

void usart3_init()
{
	RCC->APB1ENR |=(1<<18);// ENABLE USART CLOCK
	RCC->AHB1ENR |=(1<<2);// EBABLE GPIO C CLOCK ENABLE BCZ pc10(Tx) and pc11(Rx)
	GPIOC->MODER |=(1<<23); // alternate function so 10 Transmission
	GPIOC->MODER &=~(1<<22);
	GPIOC->MODER |=(1<<21);//Reciver for pc 11
	GPIOC->MODER &=~(1<<20);

	//alternate function PC10 AND PC11 refer pg 272 usart on af7 so pg 286 so af7 0111.
	//pc11
		GPIOC->AFR[1] &=~(1<<15);
		GPIOC->AFR[1] |=(1<<14);
		GPIOC->AFR[1] |=(1<<13);
		GPIOC->AFR[1] |=(1<<12);

		//pc10
	GPIOC->AFR[1] &=~(1<<11);
	GPIOC->AFR[1] |=(1<<10);
	GPIOC->AFR[1] |=(1<<9);
	GPIOC->AFR[1] |=(1<<8);

	USART3->BRR=0x0683;
	USART3->CR1 |=((1<<3)|(1<<2));// PG 1012 USART MODE ENABLE
	USART3->CR2=0;
	USART3->CR3=0;
	USART3->CR1 |=(1<<13); // enable uart
}

void usart3_write(uint8_t val)
{
	while(!(USART3->SR &=~(1<<7)));
	USART3->DR= val;
}

uint8_t usart3_read()
{
	while(!(USART3->SR&=~(1<<5)));
	return USART3->DR;

}

int main(void)
{lcd_gpio_init();
lcd_init();
	usart3_init();

	    while (1)
	    {
	        usart3_write('M'); // Send 'H'
	        for (int i = 0; i < 100; i++); // Small delay
	        result = usart3_read();
	        lcd(0x80,0);
	        char buffer[2]={result,'\0'};
	        lcd_string(buffer);
	    }
}
// FOR Transmission 51  with 52 of diff board and 63 with 63
